[
    {
        "year": "2000",
        "events": [
            {
                "note": "NOTE: The events of the Kirby Fighters rips take place in an unspecified timeframe. We do not know much about when these take place, other than that these all take place in the 2000s. Therefore, instead of dates, the rip titles will be used to date events."
            },
            {
                "title": "One Noisy Morning - Wario Land II",
                "content": "Monochrome Wario listens to bass-boosted loadsamoney out loud. This hurts Waluigi's ears.",
                "class": "KIRBY"
            },
            {
                "title": "Main Theme - Kirby Fighters",
                "content": "Monochrome Wario threatens Monochrome Kirby into giving him a Maxim Tomato. Meanwhile, 2B searches and eventually finds Waluigi's Taco Stand in the (colored) Kirby Fighters universe. She pays for a garlic taco and uses it to warp into the GB Kirby Fighters universe. When she appears, Monochrome Kirby attempts to talk to her, though 2B pays him no mind. <br><br>Noticing the portal, Monochrome Kirby and later, Monochrome Wario, jump into the portal the Garlic Taco created and meet Kirby in the main Kirby Fighters universe. Monochrome Wario expresses interest in Kirby's car and they, along with Monochrome Kirby, end up fighting for it in a turn-based battle. Kirby ends up winning by running over Monochrome Wario. Monochrome Kirby is offered to stay at Kirby's house.",
                "class": "KIRBY"
            },
            {
                "title": "Main Theme - Kirby Fighters Deluxe <i>(one day after Main Theme - Kirby Fighters)</i>",
                "content": "Kirby wakes up Monochrome Kirby. They squabble for a bit over Kirby's method of waking up Monochrome Kirby before they go to Waddlemart soon after. Monochrome Kirby is tasked with finding a dildo and asks Mr. L for help. Mr. L kidnaps Monochrome Kirby and requests Kirby to meet him in the back and give him all his money, or else Monochrome Kirby dies. <br><br>Kirby throws his grocery basket at Mr. L, who decides to mug him for all he's worth upon realizing Kirby has cocaine. Mr. L pulls out a gun and mocks him for believing he could even stand a chance, although Kirby wins via stabbing him with a pixelated dildo. <br><br><span class=\"OTHER\">In the April Fool's version of this video, Kirby lets Monochrome Kirby sleep. This triggers the secret ending. Awesome.</span>",
                "class": "KIRBY"
            },
            {
                "title": "Main Theme - Kirby Fighters 2",
                "content": "Kirby and Monochrome Kirby debate fast food restaurants, until Waluigi's Taco Stand rolls into the area. He advertises the Green de la Bean Burrito Special, although Monochrome Kirby orders an Indian Taco instead. <br><br>Monochrome Kirby's reaction to the taco burns both Kirby and Waluigi. Waluigi states that Monochrome Kirby \"will pay for this\", and they begin fighting. Halfway through, however, <span class = \"CCC\">Kirby snatches the time-traveling/interdimensional taco and sends Waluigi to the CCC, and the Garlic Taco alters Waluigi's memory so that he forgets how to make tacos.</span>",
                "class": "KIRBY"
            },
            {
                "date": "May",
                "content": "BonziBuddy receives an update changing the character associated with the program from Peedy to an original character named Bonzi."
            },
            {
                "date": "June 29",
                "content": "Jet Set Radio releases on the SEGA Dreamcast. DJ Professor K debuts as the titular radio station's DJ."
            },
            {
                "date": "July 4",
                "content": "Dr. Dre releases his single \"<i>The Next Episode</i>\", a collaboration with Snoop Dogg."
            },
            {
                "date": "July 21",
                "content": "<i>Mario Tennis</i> releases on the Nintendo 64. Waluigi, the best friend of Wario, debuts."
            }
        ]
    },
    {
        "year": "2001",
        "events": [
            {
                "date": "February 21",
                "content": "The first <i>Taiko no Tatsujin</i> game releases in Japanese arcades."
            },
            {
                "date": "May 18",
                "content": "The movie <i>Shrek</i> releases in cinemas in America; the usage of All Star in its opening credits propels Smash Mouth to stardom."
            },
            {
                "date": "September 11",
                "content": "Islamist hijackers affiliated with Al-Qaeda hijack 4 planes to commit suicide attacks against the United States. 3 of the planes hit their targets (The Twin Towers and the Pentagon), whilst a fourth is downed intentionally by its passengers."
            },
            {
                "date": "October 12",
                "content": "The first <i>Phoenix Wright: Ace Attorney</i> game releases for Game Boy Advance. Phoenix Wright debuts as the game's titular attorney."
            }
        ]
    },
    {
        "year": "2002",
        "events": [
            {
                "date": "February 22",
                "content": "<i>Jet Set Radio Future</i> releases on the XBOX."
            }
        ]
    },
    {
        "year": "2003",
        "events": [
            {
                "date": "March 21",
                "content": "<i>WarioWare, Inc.: Mega Microgame$</i> is released for Game Boy Advance, sporting a new look for Wario.",
                "class": "double-entry"
            },
            {
                "content": "The United States and 39 other countries begin their invasion of Iraq, accompanied with a massive bombing campaign. Santa, having been captured, escapes Iraq and turns it into a Christmas winter wonderland using Christmas Spirit Bombs.",
                "class": "CCC"
            }
        ]
    },
    {
        "year": "2004",
        "events": [
            {
                "date": "April",
                "content": "Hypercam 2 is released by Hyperionics."
            },
            {
                "date": "August 16",
                "content": "The first episode of <i>LazyTown</i> airs on television in Iceland."
            },
            {
                "date": "September 27",
                "content": "Snoop Dogg releases <i>Drop It Like It's Hot</i>."
            },
            {
                "date": "December 20",
                "content": "Daisuke Amaya releases <i>Cave Story</i> for free on Windows PCs."
            }
        ]
    },
    {
        "year": "2005",
        "events": [
            {
                "date": "February 14",
                "content": "American social media and online video sharing platform YouTube is established; co-founder Jawed Karim posts the first ever video, titled 'me at the zoo'."
            },
            {
                "date": "June 7",
                "content": "The LazyTown clipshow episode \"<i>Dear Diary</i>\" airs on television. A character by the name of Stingy Spoilero sings <i>The Mine Song</i>."
            },
            {
                "date": "July 26",
                "content": "<i>THE iDOLM@STER</i> is released in Japanese arcades."
            }
        ]
    },
    {
        "year": "2006",
        "events": [
            {
                "content": "Martin Billany creates a gag dub of the <i>Yu-Gi-Oh!</i> anime under the handle of LittleKuriboh, creating what is now called <i>Yu-Gi-Oh! The Abridged Series</i>. <br><br>The series acts as the originator of the entire 'Abridged' genre, and many impostor channels pop up in the following years to leech off its success."
            },
            {
                "date": "January 24",
                "content": "A pornographic video recording involving an African-American man screaming very loudly is uploaded to the Internet."
            },
            {
                "date": "July 22",
                "content": "The program MIDIJam is released."
            },
            {
                "date": "August 3",
                "content": "<i>Rhythm Tengoku</i> is released on the Game Boy Advance in Japan, featuring a minigame called \"Tap Trial\""
            },
            {
                "date": "December 12",
                "content": "Nico Nico Douga, a video sharing site similar to YouTube, launches."
            }
        ]
    },
    {
        "year": "2007",
        "events": [
            {
                "content": "Chip tha Ripper does a freestyle rap on Street Starz TV Radio that goes viral, primarily due to the line 'interior crocodile alligator'."
            },
            {
                "date": "January 25",
                "content": "<i>THE iD@LMASTER</i> releases on Xbox 360, containing the song \"<i>GO MY WAY!!</i>\""
            },
            {
                "date": "March 4",
                "content": "A video named <i>Hammoud</i> is uploaded to YouTube by Tahloube S., featuring a 3D model of a child dancing and clapping to a song. The character of Hamood Habibi originates from this video."
            },
            {
                "date": "March 13",
                "content": "Anthony Pinto creates a YouTube account with the username \"chadwarden\" for the sole purpose of trolling. Chad Warden uploads <i>Why the PS3 is better than the Wii and 360, part 1</i>."
            },
            {
                "date": "April 25",
                "content": "The first episode of <i>The Nutshack</i> airs on Myx Tv."
            },
            {
                "date": "May 2",
                "content": "Soulja Boy releases his hit single <i>Crank That (Soulja Boy)</i>."
            },
            {
                "date": "June",
                "content": "The Patriotic [Friends] use the audio clip of Loud [Friend] screaming to troll people on <i>Second Life</i>."
            },
            {
                "date": "July 3",
                "content": "Doug Walker launches a YouTube series called \"Nostalgia Critic\"."
            },
            {
                "date": "September 3",
                "content": "<i>Super Why!</i> airs on PBS Kids for the first time."
            },
            {
                "date": "October 10",
                "content": "<i>Team Fortress 2</i> releases on PC as part of a Valve collection of games called <i.>The Orange Box</i>. The titular Team Fortress, a group of 9 mercenaries, debut."
            }
        ]
    },
    {
        "year": "2008",
        "events": [
            {
                "date": "January 2",
                "content": "123zc creats his Youtube channel."
            },
            {
                "date": "January 22",
                "content": "<i>Barkley, Shut up and Jam! Gaiden</i> is released. This game becomes responsible for the association between Charles Barkley and Space Jam."
            },
            {
                "date": "March 7",
                "content": "SilvaGunner, a YouTube channel dedicated to uploading video game music, is created. TimmyTurnersDad, a similar channel, is also created."
            },
            {
                "date": "May 2",
                "content": "Chad Warden's account is deleted."
            },
            {
                "date": "July 18",
                "content": "Jack Black makes a cameo appearance on <i>Sesame Street</i> and defines the word \"octagon\" with Elmo."
            },
            {
                "date": "September 22",
                "content": "<i>Kirby Super Star Ultra</i> is released for the Nintendo DS. Masked Dedede, King Dedede's \"serious face\", first appears here in the <i>Revenge of the King</i> sub-game."
            },
            {
                "date": "October",
                "content": "Toby Fox finishes his first work, <i>EarthBound: Halloween Hack</i>, and releases it on the starmen.net forums."
            },
            {
                "date": "October 4",
                "content": "Joe Vargas creates the YouTube channel \"AngryJoeShow\"."
            }
        ]
    },
    {
        "year": "2009",
        "events": [
            {
                "date": "February 19",
                "content": "<i>THE iDOLM@STER SP: Wandering Star</i> releases for the PlayStation Portable. Takane Shijou debuts."
            },
            {
                "date": "July 28",
                "content": "hhgregg publicly shows off their new mascot, \"HH\", for the first time."
            },
            {
                "date": "July 29",
                "content": "HH is used in his first advertisement."
            },
            {
                "date": "November 20",
                "content": "thebluecat paints 3 cats playing various instruments. SiIvaGunner later adapts this painting to be the basis for the King for Another Day team \"The Jazz Cats\"."
            },
            {
                "date": "December",
                "content": "The hhgregg Red Tag Sale advertisement plays on television for the first time."
            },
            {
                "date": "December 31",
                "content": "The Walt Disney Company acquires Marvel Entertainment for $4,000,000,000 USD."
            }
        ]
    },
    {
        "year": "201X",
        "events": [
            {
                "content": "A young boy from Onett rises from the dead."
            }
        ]
    }
]